/**
 * 鍵アイコン
 * @module Lock
 */
import React from 'react'

interface LockProps {
  /**
   * 色はTailwindの`text-**`で付与する
   */
  className?: string
}

/**
 * 鍵アイコンコンポーネント
 * @param {LockProps} props - 鍵アイコンコンポーネントのプロパティ
 * @returns {React.FC} - 鍵アイコンコンポーネント
 */
export const Lock: React.FC<LockProps> = ({ className = 'text-black' }) => {
  return (
    <svg className={`${className}`} xmlns="http://www.w3.org/2000/svg" width="34" height="46" fill="none">
      <path
        d="M2.751 46.029A2.766 2.766 0 0 1 0 43.244V21.866a2.762 2.762 0 0 1 2.751-2.779h28.51a2.764 2.764 0 0 1 2.75 2.779v21.378a2.769 2.769 0 0 1-2.75 2.785Zm13.29-20.2-.037.01a4.674 4.674 0 0 0-1.621.831 4.447 4.447 0 0 0-.951 2.524 3.613 3.613 0 0 0 1.129 2.759 3.031 3.031 0 0 1 .966 2.2v4.49c1.3 1.5 2.957.584 2.957-.719v-3.176a4.234 4.234 0 0 1 1.089-2.929 3.612 3.612 0 0 0 1.006-2.5.956.956 0 0 0-.005-.124 3.667 3.667 0 0 0-.174-1 3.6 3.6 0 0 0-2.318-2.325h-.013A3.546 3.546 0 0 0 17 25.7a3.732 3.732 0 0 0-.958.126Zm6.634-8.129v-7.472a5.669 5.669 0 1 0-11.337 0V17.7H6.9v-7.472a10.105 10.105 0 1 1 20.21 0V17.7Z"
        fill="currentColor"
      />
    </svg>
  )
}
